In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [25]:
sample = pd.DataFrame([[990],[1200],[1300],[4200],[3000],[600],[700],[800],[900],[2000]],columns=['Salaries'])

In [32]:
def outlier_treatment(data):
 sorted(data)
 Q1,Q3 = np.percentile(data , [25,75])
 IQR = Q3 - Q1
 lower_range = Q1 - (1.5 * IQR)
 upper_range = Q3 + (1.5 * IQR)
 return lower_range,upper_range

In [33]:
lowerbounds,upperbounds = outlier_treatment(sample.Salaries)
print(lowerbounds)
print(upperbounds)

50.0
2050.0

In [37]:
sample[(sample.Salaries < lowerbounds) | (sample.Salaries > upperbounds)]

   Salaries
4      3000

In [38]:
sample.drop(sample[ (sample.Salaries > upperbounds) | (sample.Salaries < lowerbounds) ].index , inplace=True)

In [39]:
sample

   Salaries
0       990
1      1200
2      1300
5       600
6       700
7       800
8       900
9      2000